feat_text = '''
総記
（計1本）

020 図書、書誌学 (1)：著作権法 (アメリカ合衆国)
哲学
（計4本）

140 心理学 (1)：ノストラダムス
160 宗教 (1)：カアバ
190 キリスト教、ユダヤ教 (2)：シビュラの託宣 - ヨハネの手紙三
歴史
（計19本）

210 日本史 (4)：熊野三山本願所 - 神戸外国人居留地 - としまえんの水上設置遊具による溺水事故 - 松江騒擾事件
220 アジア史、東洋史 (2)：貴族 (中国) - 中国の女性史
230 ヨーロッパ史、西洋史 (2)：フランク王国 - 立憲民主党 (ロシア)
240 アフリカ史 (1)：第三次ポエニ戦争
270 オセアニア史、両極地方史 (1)：ハワイの歴史
280 伝記 (5)
283 ヨーロッパ：アンネ・フランク - ウィリアム・グラッドストン - フリッツ・ハーバー - ベンジャミン・ディズレーリ
284 アフリカ：ムハンマド・アリー
290 地理、地誌、紀行 (4)：小辺路 - 利根川 - バリ島 - ワシントンD.C.
社会科学
（計6本）

320 法律 (4)：少年保護手続 - 信玄公旗掛松事件 - 陪審制 - みどり荘事件
360 社会 (1)：昭和28年西日本水害
380 風俗習慣、民俗学、民族学 (1)：男の娘
自然科学
（計21本）

410 数学 (2)：0.999... - ロジスティック写像
430 化学 (1)：ベリリウム
440 天文学、宇宙科学 (2)：金星の太陽面通過 - 彗星
450 地球科学、地学 (4)：雨氷 - 黄砂 - 福岡県西方沖地震 - 南硫黄島原生自然環境保全地域
460 生物科学、一般生物学 (4)：抗酸化物質 - 酵素 - コレステロール - ヘリコバクター・ピロリ
480 動物学 (1)：深海魚
490 医学 (7)
491 基礎医学：赤血球 - 抗生物質
493 内科学：地方病 (日本住血吸虫症) - 八丈小島のマレー糸状虫症 - 白血病
494 外科学：ハンセン病
497 歯科学：エナメル質
技術
（計17本）

510 建設工学、土木工学 (4)：余部橋梁 - 関門トンネル (山陽本線) - 佐久間ダム - 中山トンネル (上越新幹線)
520 建築学 (2)：ビザンティン建築 - 姫路城
530 機械工学、原子力工学 (6)
531 機械力学・材料・設計：ばね
536 運輸工学、車両、運搬機械： 小田急3000形電車 (初代) - 京王6000系電車 - 名鉄3400系電車
538 航空工学、宇宙工学：エアバスA300 - エアバスA340
550 海洋工学、船舶工学、兵器、軍事工学 (1)：横須賀海軍施設ドック
560 金属工学、鉱山工学 (2)：ステンレス鋼 - ステンレス鋼の歴史
590 家政学、生活科学 (2)：スコッチ・ウイスキー - 蜂蜜
産業
（計5本）

670 商業 (1)：チンドン屋
680 運輸、交通、観光事業 (4)：アロハ航空243便事故 - 三里塚闘争 - 北越急行ほくほく線 - ユナイテッド航空232便不時着事故
芸術
（計22本）

700 芸術、美術 (1)：世界遺産
720 絵画、書、書道 (4)：エドゥアール・マネ - 桂正和 - サンドマン (ヴァーティゴ) - フィンセント・ファン・ゴッホ
760 音楽、舞踊、バレエ (6)
762 音楽史、各国の音楽 (3)：ディートリヒ・ブクステフーデ - レゲエ - ロベルト・シューマン
766 劇音楽 (1)：レオシュ・ヤナーチェク
767 声楽 (2)：834.194 - 藤山一郎
770 演劇、映画、大衆芸能 (1)：市川雷蔵 (8代目)
780 スポーツ、体育 (8)
783 球技：10.8決戦
788 相撲、拳闘、競馬：池上競馬場 - 岡部幸雄 - オグリキャップ - サンデーサイレンス - 天皇賞 - テンポイント - ナリタブライアン
790 諸芸、娯楽 (2)：ディシディア ファイナルファンタジー - テイルズ オブ レジェンディア
言語
（計0本）

文学
（計2本）

910 日本文学 (1)：三島由紀夫
930 英米文学 (1)：アイザック・アシモフ
'''

good_text = '''
総記
（計46本）

000 総記 (1)：UDデジタル教科書体
010 図書館、図書館情報学 (35)：
014 情報資源の収集・組織化・保存 (3)：カーリル - 蔵書印 - 目録学
015 図書館サービス、図書館活動 (1)：ニューアーク方式
016 各種の図書館 (31)：
016.2 公共図書館：
016.21 日本：
016.21 日本：CIE図書館
016.211 北海道地方：帯広市図書館
016.212 東北地方：陸前高田市立図書館
016.213 関東地方：鹿沼市立図書館 - 那須塩原市図書館 - 水戸市立図書館
016.214 北陸地方：富山県立図書館 - 富山市立図書館 - 福井市図書館
016.215 中部地方：東山・東海地方：安城市図書情報館 - 飯田市立図書館 - 一宮市立図書館 - 稲沢市図書館 - 伊那市立図書館 - 岡崎市立中央図書館 - 桑名市立中央図書館 - 甲州市立勝沼図書館 - 静岡県立中央図書館 - 静岡市立御幸町図書館 - 高山市図書館 - 田原市図書館 - 津市図書館 - 津島市立図書館 - 豊田市中央図書館 - 浜松市立中央図書館 - 飛騨市図書館 - 松阪市図書館 - みんなの森 ぎふメディアコスモス
016.216 近畿地方：近江八幡市立図書館
016.217 中国地方：海士町中央図書館
016.219 九州地方：指宿市立図書館
020 図書、書誌学 (7)：アイディア・表現二分論 - 史通 - 職務著作 - 大正天皇実録 - 著作権法 (フランス) - デジタルミレニアム著作権法 - ラランデ暦書
050 逐次刊行物 (1)：ぴあ (雑誌)
060 団体：学会、協会、会議 (1)：日本学術会議
070 ジャーナリズム、新聞 (1)：三億円別件逮捕事件
哲学
（計87本）

120 東洋思想 (1)：老子
140 心理学 (3)：ミシェル・ノストラダムス師の予言集 - ミラビリス・リベル - 暦書 (ノストラダムス)
150 倫理学、道徳 (2)：おろかもの之碑 - 誓の御柱
160 宗教 (18)：イスラームにおけるイーサー - エレウシスの秘儀 - カルナック神殿 - ギリシア神話 - クルアーンの日本語訳 - 黒石 - 神話 - ストラスブールの大モスク - 中国伊斯蘭教協会 - 中国回教協会 - 中国におけるイスラーム - 中国におけるイスラームの歴史 - 名古屋モスク - 日本イスラム教団 - 日本におけるアフマディーヤ - ハニヤス - ヒジュラ - プランバナン寺院群
170 神道 (28)：
170 神道 (1)：神道の歴史
175 神社、神職 (25)：
175.9 神社誌、神社縁起：
175.91 北海道地方：北海道の神社の歴史
175.92 東北地方：伊佐須美神社
175.93 関東地方：奥澤神社 - 鹿島神宮 - 筑波山神社 - 鷲子山上神社
175.94 北陸地方：氣比神宮 - 松苧神社
175.95 中部地方：東山・東海地方：伊古奈比咩命神社 - お白石持 - 佐美長神社 - 富士山本宮浅間大社 - 三嶋大社 - 南新宮社
175.96 近畿地方：網野神社 - 出石神社 - 神谷太刀宮神社 - 九十九王子 (田辺市中辺路町) - 九十九王子 (田辺市本宮町) - 住吉大社 - 滝尻王子 - 玉置神社 - 松尾大社
175.99 九州地方：沖縄県の神社の歴史 - 香椎宮
176 祭祀 (1)：神饌
178 各教派、教派 (1)：竹内巨麿
180 仏教 (21)：
180 仏教 (1)：ダライ・ラマ13世
182 仏教史 (3)：鎌倉仏教 - 天狗草紙 - 日本仏教の戒律史
185 寺院、僧職 (11)：飛鳥寺 - 上山寺 - 正受庵 - 森巌寺 (世田谷区) - 備崎経塚 - 枕石寺 - 東慶寺 - 東大寺の歴史 - 東大寺法華堂 - 陸奥国分寺 - 蓮華寺 (京都市左京区)
186 仏会 (5)：社寺参詣曼荼羅 - 即位灌頂 - 那智参詣曼荼羅 - 法隆寺金堂釈迦三尊像光背銘 - 法隆寺金堂薬師如来像光背銘
188 各宗 (1)：文観
190 キリスト教、ユダヤ教 (14)：アッシジのフランチェスコ - カトリック主税町教会 - 95か条の論題 - 全ての教皇に関する大司教聖マラキの預言 - テサロニケの信徒への手紙二 - 日本語訳聖書 - 日本ハリストス正教会 - ピアソン夫妻 - フランシスコ (ローマ教皇) - プレスター・ジョン - ペトロの手紙二 - ユダの手紙 - リバーサイド教会 - レオ10世による贖宥状
歴史
（計690本）

200 歴史、世界史、文化史 (6)：ウイスキー戦争 - 枢軸時代 - 前1200年のカタストロフ - 中ソ紛争 - ポーツマス条約 - 歴史修正主義
日本史
210 日本史 (83)：
210 日本史 (25)：
210.02 歴史補助学：麟 (織田信長の花押)
210.3 古代 4世紀-1185：葺石 - 仏足跡歌碑
210.4 中世 1185-1600、前期封建時代：吾妻鏡 - 正中の変 - 納銭方
210.5 近世 1600-1867、後期封建時代、江戸時代、幕藩体制：犬小屋 (江戸幕府) - 江戸時代の三貨制度 - 株仲間解散令 - 株仲間再興令 - 唐物抜荷事件 - 元禄文化 - ゴローニン事件 - 薩摩藩の長崎商法 - 天明の打ちこわし - 四つの口
210.6 近代 1868-、明治時代 1868-1912：桂・ハリマン協定 - 司法官弄花事件 - 条約改正
210.69 大正時代 1912-1926：カボチャ陳情団 - 宮中某重大事件 - 写真花嫁
210.7 昭和・平成時代 1926-：樺太の戦い (1945年) - 成田空港問題の年表 - バラク・オバマの広島訪問
212 東北地方 (2)：秋田城 - 能代大火
213 関東地方 (30)：
213.1 茨城県：共楽館 - 那珂湊反射炉
213.2 栃木県：栃木県庁の移転
213.3 群馬県：群馬コーヒー事件 - 毛野
213.4 埼玉県：熊谷空襲 - 幸手宿 - 飯能戦争
213.5 千葉県：金鈴塚古墳 - 浅間山古墳 (栄町) - 内裏塚古墳群 - 成田空港予定地の代執行 - 龍角寺古墳群
213.6 東京都：アメリカ施政権下の小笠原諸島 - 石野遺跡 - 江戸の火事 - 大島大誓言 - 還住 (青ヶ島) - 桑茶政策 - 桜木遺跡 (世田谷区) - 三島事件 - 矢ガモ
213.7 神奈川県：川崎市の歴史 - 旧横須賀鎮守府庁舎 - 小松 (料亭) - 燈明堂 (横須賀市) - 長柄桜山古墳群 - ペリー上陸記念碑 - やぐら - 横須賀空襲
214 北陸地方 (1)：富山大空襲
215 中部地方：東山・東海地方 (5)：石徹白騒動 - 御土居下御側組同心 - 郡上一揆 - 高尾山古墳 - 中島飛行機半田製作所
216 近畿地方 (8)：伊勢暴動 - イルカボーイズ - 大山崎油座 - 紀州征伐 - 北の大火 - 熊野別当 - 醒井宿 - 信貴山城
217 中国地方 (5)：相生橋 - 岡山地底湖行方不明事故 - 鴨島 (島根県) - 中国攻め - 出口川のカドミウム汚染
219 九州地方 (7)：怡土城 - 薩摩藩の天保改革 - 振武寮 - 夏目漱石内坪井旧居 - 門司の歴史 - ラサ島鉱業所 - 琉球の朝貢と冊封の歴史
アジア史、東洋史
220 アジア史、東洋史 (70)：
220 アジア史、東洋史 (5)：阿里山丸 - 竹一船団 - 日豪砂糖交渉 - 分島問題 - 松輸送
221 朝鮮 (6)：百済 - 高句麗 - 新安沈船 - 壬午軍乱 - 斗満虐殺事件 - 釜山橋頭堡の戦い
222 中国 (9)：アウルク - オゴデイ・ウルス - 広東システム - 呉鳳 - 中華人民共和国大飢饉 - 投下 (モンゴル帝国) - 南華文芸・北新書局事件 - 馬王堆漢墓 - 満洲還付条約
223 東南アジア (8)：アヴァ王朝 - カンボジア特別法廷 - コー・ケー - 陳朝 - パンロン会議 - ピュー - 仏印進駐 - マラッカ王国
224 インドネシア (4)：華僑虐殺事件 (バタヴィア) - サレカット・イスラム - 日本占領時期のインドネシア - マニラ奇襲 (1798年)
225 インド (5)：イギリス東インド会社 - イギリス領インド帝国 - セイロン侵攻 - 日本軍によるアンダマン・ニコバル諸島の占領 - バングラデシュ大虐殺 (1971年)
227 西南アジア・中東（中近東） (21)：
227 西南アジア・中東（中近東）：第二次内乱 (イスラーム史)
227.2 イラン（ペルシア）：ギーラーン共和国 - サーマーン朝 - パルティア - モンゴルのニザール派討滅 - モンゴルのホラズム・シャー朝征服
227.3 イラク（メソポタミア）：バビロニア
227.4 トルコ：アッバース朝の小アジア侵攻 (806年) - アモリオンの戦い - コンスタンティノープル包囲戦 (674年-678年) - コンスタンティノープル包囲戦 (717年-718年) - タンジマート - ララカオンの戦い - ルーム・セルジューク朝
227.5 シリア：アイユーブ朝 - アザーズの戦い (1030年) - パルミラ
227.8 アラビア半島：クウェート共和国 - ヒムヤル王国 - メッカ事件 - ラスール朝
229 アジアロシア (12)：アラブ・ハザール戦争 - アルメニアの歴史 - オルダ・ウルス - カラハン朝 - 北樺太石油 - グルジア問題 - ナゴルノ・カラバフ自治州 - 尼港事件 - ヒヴァ・ハン国 - マー・ワラー・アンナフル - 南オセチア紛争 (2008年) - 流鬼国
ヨーロッパ史、西洋史
230 ヨーロッパ史、西洋史 (77)：
230 ヨーロッパ史、西洋史 (12)：アルマダの海戦 - ヴァンダル戦争 - 英西戦争 (1727年-1729年) - 強制収容所 (ナチス) - ゴート戦争 - 四国同盟戦争 - 七年戦争 - 第三次イタリア戦争 - 第五次イタリア戦争 - 大北方戦争 - ポーランド・ロシア戦争 (1792年) - 北海大陸棚事件
231 古代ギリシア (2)：暗黒時代 (古代ギリシア) - ナビス戦争
232 古代ローマ (2)：剣闘士 - 第三次奴隷戦争
233 イギリス、英国 (6)：ソープ事件 - ゾング号事件 - 薔薇戦争 - ピータールーの虐殺 - リチャード3世の発掘と再埋葬 - レジサイド (チャールズ1世)
234 ドイツ、中欧 (18)：アウステルリッツの戦い - ヴァイマル共和政のハイパーインフレーション - ウルム戦役 - 鷗外・ナウマン論争 - 騎士戦争 - シュレージエン戦争 - 神聖ローマ帝国 - スィゲトヴァール包囲戦 - 水晶の夜 - 世紀末ウィーン - 第一次シュレージエン戦争 - タンネンベルクの戦い (1410年) - ドイツ国大統領 - 突撃隊 - トルダの勅令 - モンゴルの神聖ローマ帝国侵攻 - ロボジッツの戦い - ワルシャワ・ゲットー蜂起
235 フランス (4)：オーヴァーロード作戦 - ナチス・ドイツによるフランス占領 - ユグノー戦争 - ワーテルローの戦い
236 スペイン（イスパニア）、ポルトガル (7)：アヴィス王朝 - アルブエラの戦い - ゲルニカ爆撃 - ナスル朝 - バスク地方 - バスク・ナショナリズム - ポルトガルの歴史
237 イタリア (2)：イタリア統一運動 - ファスティアン作戦
238 ロシア (6)：エストニアの独立回復 - スラヴ民族の北東ルーシへの移動 - タタールのくびき - バルト諸国占領 - 北欧史 - ロシア帝国の歴史
239 バルカン諸国 (18)：カラブリュエの戦い - ギリシャ軍事政権 - ギリシャ独立戦争 - ギリシャの戦い - クレタ島の歴史 - クレフテス - クロアチア王国 (925年-1102年) - クロアチアの歴史 - コソボの歴史 - サラエボ事件 - スロベニアの歴史 - 第二次ブルガリア帝国 - ビザンツ帝国内乱 (1341年-1347年) - ブルガリア公国 - ユーゴスラビア王国 - ユーゴスラビア社会主義連邦共和国 - ワラキア - ワラキア蜂起
アフリカ史
240 アフリカ史 (18)：アレクサンドリア図書館 - イギリス・ザンジバル戦争 - イタリアのエジプト侵攻 - エジプト先王朝時代 - エジプト中王国 - エジプトの歴史 - クンタ・キンテ島と関連遺跡群 - ザイヤーン朝 - サハラ交易 - ソコト帝国 - チャド・リビア紛争 - ファーティマ朝のエジプト侵攻 (914年-915年) - ファーティマ朝のエジプト侵攻 (919年-921年) - ファーティマ朝のエジプト征服 - ファラオ - プトレマイオス朝 - メンフィス (エジプト) - ルワンダ虐殺
北アメリカ史
250 北アメリカ史 (15)：アン女王戦争 - インディアスの破壊についての簡潔な報告 - カナダ侵攻作戦 - キューバの雪解け - グアテマラ革命 - コスタリカの歴史 - サッカー戦争 - ジャーマンフラッツへの攻撃 - ドナー隊 - ドミニカ侵攻 - ニカラグア事件 - 2009年バラク・オバマ大統領就任式 - ハイチ革命 - ハリファックス大爆発 - バンカーヒルの戦い
南アメリカ史
260 南アメリカ史 (5)：インカ道 - オキナワ移住地 - パタゴン - パラグアイの歴史 - ボリビアの歴史
オセアニア史、両極地方史
270 オセアニア史、両極地方史 (6)：ナンマトル - ハワイ併合 - 東入植地 - ビラ・スタンモーア夜戦 - ベラ湾夜戦 - ラバウル空襲
伝記
280 伝記 (250)：
281 日本 (3)：安東氏 - 高力氏 - 国分氏 (陸奥国)
288 系譜、家史、皇室 (8)：皇太子徳仁親王と小和田雅子の結婚の儀 - 皇太子裕仁親王の欧州訪問 - 後円融天皇 - 後光厳天皇 - 御料馬車 - 大正天皇 - 伏見天皇 - フルール・ド・リス
289 個人伝記 (239)：
289.1 日本：藍川清成 - 吾妻四郎助光 - 荒木初子 - 安藤百福 - 飯塚伊賀七 - 飯盛里安 - 伊藤初代 - 伊東里き - 伊能忠敬 - 牛山喜久子 - 宇良田唯 - 榎本武揚 - 榎本三恵子 - 大槻磐渓 - 大西瀧治郎 - 岡田健蔵 - 岡上菊栄 - 織田信長 - 織田信行 - 甲斐姫 - 木村修治 - クサヴェラ・レーメ - 光明皇后 - 佐伯輝子 - 佐伯敏子 (反核運動家) - 斎藤智恵子 - 坂本龍馬 - 笹井芳樹 - 佐藤在寛 - 佐野文子 - 芝山みよか - 渋谷黎子 - 舜天 - 杉原千畝 - 高橋瑞子 - 高橋峯吉 - 高橋至時 - 田島弥平 - 辰口信夫 - 田中舘愛橘 - 千野敏子 - 辻キヨ - 津田応助 - 恒藤規隆 - 徳川家達 - 戸倉ハル - 中川イセ - 中田厚仁 - 永浜宇平 - 二階堂トクヨ - 二条藤子 - 沼田鈴子 - 橋本宗吉 - 羽田孜 - 花田ミキ - 羽根田利夫 - 福澤桃介 - 北条氏綱 - 保阪潤治 - 堀内良平 - 真島襄一郎 - 美幾 - 三木武夫 - 御匣殿 (西園寺公顕女) - 水谷新六 - 村井多嘉子 - 矢数道明 - 山本幡男 - 米村でんじろう - 和田カツ - 渡辺カネ
289.2 アジア、東洋：
289.22 中国：汪兆銘 - 始皇帝 - 司馬遷 - 蔣経国 - 陳時中 - 鄭麗君 - 頼品妤
289.24 インドネシア：カルティニ
289.25 インド：アラー・ウッディーン・ハルジー - スバス・チャンドラ・ボース - ムハンマド・アリー・ジンナー
289.27 西南アジア・中東：アッシュルバニパル - アブドゥルマリク - イブン・スィーナー - ウルグ・ベク - エサルハドン - カワード1世 - サーリフ・ブン・ミルダース - サルゴン2世 - ズファル・ブン・アル＝ハーリス・アル＝キラービー - スライマーン (ウマイヤ朝) - ダレイオス1世 - ティムール - バヤズィト1世 - バヤズィト2世 - ペーローズ1世 - マルワーン1世 - マンスール - ムウタディド - ムティー - ムフタール・アッ＝サカフィー - メフメト2世 - ヤズィード1世 - ワリード1世
289.3 ヨーロッパ、西洋：
289.33 イギリス、英国：アーサー・ウェルズリー (初代ウェリントン公爵) - アーサー・バルフォア - アーネスト・シャクルトン - ヴィクトリア (イギリス女王) - ウィリアム・キャヴェンディッシュ (第4代デヴォンシャー公爵) - ウィリアム・キャヴェンディッシュ＝ベンティンク (第3代ポートランド公爵) - ウィリアム・グレンヴィル (初代グレンヴィル男爵) - ウィリアム・ピット (初代チャタム伯爵) - ウィリアム・ペティ (第2代シェルバーン伯) - ウィリアム・ラム (第2代メルバーン子爵) - ウィンストン・チャーチル - エドワード7世 (イギリス王) - エドワード・ウッド (初代ハリファックス伯爵) - エドワード・スミス＝スタンリー (第14代ダービー伯爵) - エドワード・ハイド (初代クラレンドン伯爵) - エドワード8世の退位 - エリザベス1世 (イングランド女王) - オエンガス1世 (ピクト王) - オーガスタス・フィッツロイ (第3代グラフトン公) - コリン・レンフルー - ジェームズ・ワット - ジェレミー・ソープ - ジョージ・カニング - ジョージ・グレンヴィル - ジョージ・ジャーメイン (初代サックヴィル子爵) - ジョージ・ドディントン (初代メルコム男爵) - ジョージ・マカートニー (初代マカートニー伯爵) - ジョゼフ・チェンバレン - ジョゼフ・プリーストリー - ジョン・ステュアート (第3代ビュート伯) - ジョン・ラッセル (初代ラッセル伯爵) - スタンリー・ボールドウィン - スペンサー・コンプトン (初代ウィルミントン伯爵) - スペンサー・パーシヴァル - ダイアナ (プリンセス・オブ・ウェールズ) - チャールズ・ワトソン＝ウェントワース (第2代ロッキンガム侯) - チャールズ・グレイ (第2代グレイ伯爵) - チャールズ・ジェームズ・フォックス - チャールズ・スペンサー (第3代サンダーランド伯) - デビッド・ロイド・ジョージ - トーマス・マコーリー - トマス・ペラム＝ホリス (初代ニューカッスル公爵) - ハーバート・ヘンリー・アスキス - ヒュー・パーシー (第3代ノーサンバーランド公爵) - フレデリック・ノース (第2代ギルフォード伯爵) - フレデリック・ロビンソン (初代ゴドリッチ子爵) - ヘンリー・キャヴェンディッシュ - ヘンリー・ジョン・テンプル (第3代パーマストン子爵) - ヘンリー・ペラム - ロバート・ウォルポール - ロバート・ガスコイン＝セシル (第3代ソールズベリー侯) - ロバート・ピール
289.34 ドイツ、中欧：アッティラ - アドルフ・ヒトラーの死 - アルブレヒト・フォン・ローン - ヴィルヘルム1世 (ドイツ皇帝) - ヴィルヘルム2世 (ドイツ皇帝) - エルヴィン・ロンメル - エルンスト・カルテンブルンナー - オットー・フォン・ハプスブルク - オットー・フォン・ビスマルク - オットー・フランク - カール・ボッシュ - カール・マルクス - カール1世 (オーストリア皇帝) - カール4世 (神聖ローマ皇帝) - クラウス・フォン・シュタウフェンベルク - ハインリヒ・ヒムラー - パウル・フォン・ヒンデンブルク - フェルディナント・ラッサール - フランツ・フォン・パーペン - フランツ・ヨーゼフ1世 (オーストリア皇帝) - ヘルマン・ゲーリング - ヘルムート・カール・ベルンハルト・フォン・モルトケ - マックス・プランク - マリ・キュリー - ユリウス・ロベルト・フォン・マイヤー - ラインハルト・ハイドリヒ - リーゼ・マイトナー - レオ・シラード
289.35 フランス：イレーヌ・ジョリオ＝キュリー - ジャンヌ・ダルク - ナポレオン3世 - マリー＝アンヌ・ピエレット・ポールズ - ラファイエット - ルイ14世 (フランス王) - レオポルド2世 (ベルギー王)
289.36 スペイン（イスパニア）：イスマーイール1世 (ナスル朝) - ナスル (ナスル朝) - フェルディナンド・マゼラン - ムハンマド1世 (ナスル朝) - ムハンマド2世 (ナスル朝) - ムハンマド3世 (ナスル朝) - ムハンマド4世 (ナスル朝)
289.37 イタリア：アルキメデス - カトリーヌ・ド・メディシス - チェーザレ・ボルジア - フリードリヒ2世 (神聖ローマ皇帝) - ベニート・ムッソリーニの死 - マルコ・ポーロ - レオナルド・ダ・ヴィンチ
289.38 ロシア・北欧：アナスタシア・ニコラエヴナ - アレクサンドル・ゴルチャコフ - イヴァン4世 - ウラジーミル・ナボコフ (政治家) - ウラジーミル・レーニン - カール14世ヨハン (スウェーデン王) - カール・グスタフ・エミール・マンネルヘイム - グリゴリー・ラスプーチン - ニコライ2世 (ロシア皇帝) - ピョートル1世 (ロシア皇帝) - マリア・ニコラエヴナ (ニコライ2世皇女) - ミハイル・アレクサンドロヴィチ (1878-1918)
289.39 バルカン諸国：コンスタンティヌス1世 - シュチェパン・マリ - スティエパン・トマシェヴィチ (ボスニア王) - スラヴ人トマス - ティベリオス3世 - ユスティニアヌス1世 - ラザル・フレベリャノヴィチ (セルビアの侯)
289.4 アフリカ：アーディド - イブン・バットゥータ - ツタンカーメン - バイバルス - ムハンマド・ブン・トゥグジュ - ラムセス3世
289.5 北アメリカ：アレクサンダー・グラハム・ベル - ネイト・シルバー - ネリー・ブライ - マーク・ミッチャー - ライナス・ポーリング - リッチモンド・K・ターナー
289.6 南アメリカ：ルイス・アルヴェス・デ・リマ・エ・シルヴァ (カシアス公爵)
289.7 オセアニア：イェーガン
地理、地誌、紀行
290 地理、地誌、紀行 (158)：
290.1 地理学、人文地理学、地誌学 (2)：人文地理学の歴史 - 島嶼性
291 日本 (104)：
291 日本：地図混乱地域
291.1 北海道地方：ピョウタンの滝 - 藻岩山
291.2 東北地方：浅虫温泉 - キリストの墓 (日本) - 古川沼
291.3 関東地方：大沼 (赤城山) - 蔵の街 - 古賀志町 - 駒生 (宇都宮市) - 子持山 - 逆川 (水戸市) - 渋谷スクランブル交差点 - 千波湖 - 榛名湖 - 檜洞丸 - 御橋通り - 谷田部 (つくば市) - 柳窪
291.4 北陸地方：海士町 (輪島市) - 若栃
291.5 中部地方：東山・東海地方：阿児町国府 - 大明西町 - 大明東町 - 御嶽山 - 香良洲町 - 紀和町花井 - 国崎町 - 小渋川 - 佐久島 - 篠島 - 志摩町片田 - 志摩町越賀 - 志摩町和具 - 乗鞍岳 - 浜島町迫子 - 日間賀島 - 間崎島 - 御幸道路 - 女神湖 - 桃取町
291.6 近畿地方：
291.61 滋賀県：菅浦の湖岸集落
291.62 京都府：磯 (京丹後市) - 経ヶ岬灯台 - 琴引浜 - 小浜 (京丹後市) - 袖志の棚田 - 鷹峯 - 成生 (舞鶴市) - 如意ヶ嶽 - 野間地域 - 浜詰 - 原谷 (京都市) - 東一口 - 樋越川 - 平 (京丹後市) - 三津 (京丹後市) - 味土野 - 和田野
291.64 兵庫県：淡路国道マツ並木
291.65 奈良県：七色 (十津川村)
291.66 和歌山県：熊野川町九重
291.7 中国地方：海士町 - 綾羅木 - 生口島 - 犬島 - 因島 - 小瀬川 - 尾道 - 音戸の瀬戸 - 笠岡諸島 - 蒲生川 (鳥取県) - 長府 - 人形峠 - 平和大通り - 水尻池 - 三徳川 - 湯山池
291.8 四国地方：江川崎 - 男木島
291.9 九州地方：南西諸島
291.91 福岡県：堀川用水 - 門司区
291.92 佐賀県：東よか干潟 - 兵庫 (佐賀市)
291.97 鹿児島県：有村町 - 鹿島町藺牟田 - 上甑島 - 口之島 - 黒神町 - 甑島列島 - 下甑島 - 東郷町藤川 - 東市来町美山 - 日吉町吉利 - 坊津町秋目 - 坊津町久志 - 坊津町泊 - 坊津町坊 - 吉野 (鹿児島市)
291.99 沖縄県：硫黄鳥島 - 伊計島 - 沖大東島 - 平安座島
292 アジア、東洋 (6)：アイヌ語地名 - インドの地理 - コンスタンティノープルの城壁 - 中国丹霞 - バイカル湖 - マラッカ海峡
293 ヨーロッパ、西洋 (17)：アウクスブルク - アウター・ヘブリディーズ - アムステルダムの運河 - カタルーニャ州 - サラエヴォ - シェトランド諸島 - スペインの地理 - チプロフツィ - ナバラ州 - バスク州 - ハンブルクの倉庫街とチリハウスを含む商館街 - ベオグラード - 北部諸島 (イギリス) - ホッローケー - マヨルカ島 - ヨークシャー - ロンドン
294 アフリカ (6)：アフリカ - コンソ - サルーム・デルタ - タハリール広場 - フェズ - マダガスカル
295 北アメリカ (17)：アクロン (オハイオ州) - アトランタ - アメリカ＝メキシコ国境 - アレクサンドリア (ルイジアナ州) - クリーブランド (オハイオ州) - スリー・シスターズ (オレゴン州) - ニューヨーク - ピッツバーグ - ヒューストン - ヒルズボロ (オレゴン州) - プライス山 (ブリティッシュコロンビア州) - ボストン - マンスフィールド (オハイオ州) - ミネアポリス - ヤングスタウン (オハイオ州) - ヨセミテ国立公園 - ローリー (ノースカロライナ州)
296 南アメリカ (2)：ウビナス - タアパカ
297 オセアニア、両極地方 (5)：グレートバリアリーフ - タカヘ山 - ティウィ諸島 - フォード島 - 南極点
社会科学
（計146本）

310 政治 (21)：
312 政治史、事情 (6)：ケチャップは野菜 - 光復香港、時代革命 - 2019年6月9日香港逃亡犯条例改正案反対デモ - 2019年6月12日香港逃亡犯条例改正案反対デモ - 2019年6月16日香港逃亡犯条例改正案反対デモ - バラク・オバマの国籍陰謀論
313 国家の形態、政治体制 (2)：中華民国総統 - 中華民国の元首
314 議会 (2)：貴族院 (イギリス) - スコットランド議会
315 政党、政治結社 (4)：ドイツ共産党 - ドイツ社会主義統一党 - ドイツ社会民主党 - ドイツのための選択肢
316 国家と個人・宗教・民族 (1)：ブリストル・バス・ボイコット事件
317 行政 (4)：アルフ・フォン・ムト・ハイム - ガーター勲章 - 勲章 (日本) - 中華民国政府
319 外交、国際問題 (2)：エストニアとロシアの領有権問題 - 岸田文雄のウクライナ訪問
320 法律 (11)：アメリカ合衆国旅券 - エストニアの国籍 - 大阪南港事件 - 公海 - 自由海論 - 2019年逃亡犯条例改正案 - 法解釈 - 無害通航 - 名目的取締役 - ユニバーサル・シティ・スタジオ対任天堂裁判 - リスボン条約
330 経済 (21)：
331 経済学 (4)：経済成長の黄金律 - ゲーム理論 - 国富論 - 内部補助
332 経済史・事情、経済体制 (8)：アメリカ合衆国の経済史 - イギリスの経済 - イスラム経済 - 世界金融危機 (2007年-2010年) - 中華人民共和国の経済 - チューリップ・バブル - 朝鮮民主主義人民共和国の経済史 - ナチス・ドイツの経済
335 企業、経営 (1)： セントラル・パーク管理委員会
336 経営管理 (3)：会計史 - 監査に関する品質管理基準 - スムマ
337 貨幣、通貨 (5)：ガズデン購入50セント硬貨 - 貨幣史 - 中国の貨幣制度史 - ドゥニエ - 貝貨
340 財政 (1)：入湯税
360 社会 (44)：
361 社会学 (4)：アメリカ合衆国における東アジア人のステレオタイプ - きさらぎ駅 - キャラ (コミュニケーション) - 八鹿高校事件
362 社会史、社会体制 (2)：世襲貴族 - ロシアの農奴制
366 労働経済、労働問題 (1)：家事使用人
367 家族問題、男性・女性問題、老人問題 (2)：アラ・カチュー - ナチスの女性政策
368 社会病理 (33)：
368.6 犯罪、犯罪人、組織犯罪：
368.61 殺人、暗殺：
368.61021 日本：古谷惣吉連続殺人事件
368.610212 東北地方：青森県新和村一家7人殺害事件 - 弘前大教授夫人殺し事件
368.610213 関東地方：阿部守太郎暗殺事件 - 市川一家4人殺害事件 - 柏の少女殺し事件 - 国立市主婦殺害事件 - JT女性社員逆恨み殺人事件 - 下館事件 - 八丈島事件 - ピアノ騒音殺人事件 - 藤沢市女子高生殺害事件 - 山下事件
368.610214 北陸地方：一家四人死刑事件 - 遠藤事件
368.610215 中部地方：東山・東海地方：愛知県蟹江町母子3人殺傷事件 - 小島事件 - 司ちゃん誘拐殺人事件 - 長野県市田村一家7人殺害事件 - 名古屋アベック殺人事件 - 名古屋女子大生誘拐殺人事件 - 闇サイト殺人事件
368.610216 近畿地方：京都アニメーション放火殺人事件 - 京都・大阪連続強盗殺人事件 - 京都小学生殺害事件 - 小笛事件
368.610217 中国地方：広島タクシー運転手連続殺人事件
368.610219 九州地方：別府3億円保険金殺人事件 - 松橋事件
368.61023 ヨーロッパ・西洋：オスカー・スレイター事件
368.62 誘拐：石狩町女子高生誘拐事件
368.65 窃盗、強盗：清水局事件
368.7 青少年犯罪：刃物を持たない運動
369 社会福祉 (3)：子ども食堂 - 天災は忘れた頃にやってくる - 平成26年8月豪雨による広島市の土砂災害
370 教育 (5)：スクールカースト - 栃木県立特別支援学校宇都宮青葉高等学園 - 富山市立奥田中学校いじめ自殺事件 - トリニティ・カレッジ (ダブリン大学) - 日本女子体育専門学校 (旧制)
380 風俗習慣、民俗学、民族学 (33)：
382 風俗史、民俗誌、民族誌 (4)：スポ根 - なんちゃっておじさん - フン族の起源 - やおい
383 衣食住の習俗 (7)：アフリカン・ワックス・プリント - コーヒーの歴史 - ソビエト連邦の食事情 - 日本のカレー - 日本の獣肉食の歴史 - 原宿のファッション史 - 賄征伐
386 年中行事、祭礼 (9)：加悦谷祭 - こまねこまつり - 天津司舞 - 鳥取しゃんしゃん祭 - 豊橋鬼祭 - 日野祭 - 放生祭 - 無生野の大念仏 - 吉田の火祭
387 民間信仰、迷信（俗信）(5)：狐の嫁入り - 死神 (日本) - 太子信仰 - 田の神 - 化け猫
388 伝説、民話（昔話）(1)：鰊場作業唄
389 民族学、文化人類学 (7)：ウィルタ - ウデヘ - スウェーデン系フィンランド人 - トラジャ族 - ニヴフ - 満洲民族 - ルーマニアのユダヤ人の歴史
390 国防、軍事 (9)：大久野島の毒ガス製造 - 軍服 (ドイツ国防軍空軍) - 軍服 (ドイツ国防軍陸軍) - 河辺飛行場 - 制服 (ナチス親衛隊) - 竹永事件 - チューレ空軍基地米軍機墜落事故 - 寧辺核施設 - ブルーインパルス
自然科学
（計314本）

400 自然科学 (8)：閏秒 - 査読なんか怖くない? - 測定 - バタフライ効果 - 秒 - 放射性炭素年代測定 - メートル - ロンドン自然史博物館
数学
410 数学 (4)：エジプト式分数 - セル・オートマトン - ポアンカレ・ベンディクソンの定理 - リミットサイクル
物理学
420 物理学 (8)：カロリック説 - ガリレオによるピサの斜塔実験 - 重力波の初検出 - 線形多自由度系の振動 - 単振動 - 半金属 (バンド理論) - フーコーの振り子 - 摩擦
化学
430 化学 (20)：イットリウム - カリウム - ガリウム - 金属 - 元素 - 酢酸 - サマリウム - 酸素 - 周期表 - 水素 - セシウム - タンタル - 銅 - ニオブ - バリウム - 半金属 - フロギストン説 - プロトン化水素分子 - ホウ素 - リチウム
天文学、宇宙科学
440 天文学、宇宙科学 (52)：
441 理論天文学、数理天文学 (1)：馬蹄形軌道
442 実地天文学、天体観測法 (3)：大論争 (天文学) - ハッブル・ディープ・フィールド - ペイル・ブルー・ドット
443 恒星、恒星天文学 (17)：ウォルフ・ライエ星 - うみへび座 - かみのけ座 - かんむり座 - 銀河 - こと座 - さんかく座 - しし座 - 主系列星 - 赤色矮星 - 白色矮星 - ペガスス座 - ベテルギウス - みずがめ座 - みなみじゅうじ座 - みなみのうお座 - わし座
444 太陽、太陽物理学 (3)：太陽 - 太陽系 - 太陽系の形成と進化
445 惑星、衛星 (20)：イオ (衛星) - イトカワ (小惑星) - HD 189733 b - エウロパ (衛星) - エッジワース・カイパーベルト - 海王星 - 海王星の環 - 火星の生命 - ガニメデ (衛星) - ケプラー16b - ケレス (準惑星) - 水星 - タイタン (衛星) - 太陽系外惑星 - 天王星の衛星 - 土星の衛星 - TRAPPIST-1 - 木星 - 木星の大気 - 惑星の定義
447 彗星、流星 (1)：2013年チェリャビンスク州の隕石落下
448 地球、天文地理学 (4)：経度の歴史 - 大日本沿海輿地全図 - 地球 - 地球の年齢
449 時法、暦学 (3)：お化け暦 - 垂揺球儀 - 月 (暦)
地球科学、地学
450 地球科学、地学 (41)：
451 気象学 (7)：アリソフの気候区分 - 霜 - 測雨器 - 筑波山神社・筑波大学計算科学研究センター共同気象観測所 - 夏のない年 - 南極の気候 - 日本の気候
452 海洋学 (1)：大洋
453 地震学 (12)：安政南海地震 - 安政東海地震 - 安政の大地震 - 岩手・宮城内陸地震 - 桜島の大正大噴火 - 1888年の磐梯山噴火 - 箱根火山の形成史 - 宝永地震 - 宝永大噴火 - 明応地震 - 歴史地震 - ロイヒ
454 地形学 (3)：河内風穴 - 夏油温泉の石灰華 - 満奇洞
455 地質学 (1)：付加体
456 地史学、層位学 (2)：顕生代 - 人新世
457 古生物学、化石 (9)：アキシマクジラ - 姉帯小鳥谷根反の珪化木地帯 - アルバートサウルス - アロサウルス - 化石戦争 - スピノサウルス - タルボサウルス - 澄江の化石産地 - メガケイラ類
458 岩石学 (3)：岩神の飛石 - 上野村亀甲石産地 - 美濃の壺石
459 鉱物学 (3)：糸魚川のヒスイ - 縞状鉄鉱床 - レニウム鉱
生物科学、一般生物学
460 生物科学、一般生物学 (29)：
460 生物科学、一般生物学 (3)：真核生物 - 生命 - リンネ式階層分類体系
461 理論生物学、生命論 (1)：ロジスティック方程式
462 生物地理、生物誌 (4)：小笠原諸島の自然 - 皇居の生物相 - 浄ノ池特有魚類生息地 - 富田川のオオウナギ生息地
463 細胞学 (2)：上皮成長因子受容体 - チラコイド
464 生化学 (2)：セルピン - プリオン
465 微生物学 (6)：古細菌 - 赤痢菌 - ニューモシスチス・イロベチイ - 微生物 - 微生物叢 - ポリオウイルス
467 遺伝学 (7)：遺伝子 - X染色体の不活性化 - 性決定 - 染色体説 - 断続平衡説 - テロメラーゼ - メタゲノミクス
469 人類学 (4)：アルディ (アルディピテクス) - 現生人類の拡散 - セラム - ルーシー (アウストラロピテクス)
植物学
470 植物学 (55)：
471 一般植物学 (8)：根粒 - 師部 - 道管 - 根 - 発芽 - 胞子嚢穂 - 芽 - 木部
472 植物地理、植物誌 (12)：上野楢原のシオジ林 - 江戸城跡のヒカリゴケ生育地 - シシンラン群落 - 中川の箒スギ - 西阿倉川アイナシ自生地 - 日本最古のりんごの木 - 日本の高山植物相 - 早川のビランジュ - 東阿倉川イヌナシ自生地 - 平糠のイヌブナ自然林 - 平松のウツクシマツ自生地 - 妙国寺のソテツ
473 葉状植物 (1)：変形菌
474 藻類、菌類 (12)：アマノリ - オキチモズク - 温泉藻 - 褐藻 - 菌根 - 菌輪 - 紅藻 - ツキヨタケ - ヒダハタケ - ラクタリウス・インディゴ - 藍藻 - 緑藻
475 コケ植物 (2)：茎葉体 - コケ植物
476 シダ植物 (3)：アカウキクサ属 - トクサ類 - PPG I
477 種子植物 (1)：受粉
478 裸子植物 (6)：イチョウ - 球果 - スギ - ソテツ - メタセコイア - 裸子植物
479 被子植物 (10)：液果 - 果実 - ザクロ - タニワタリノキ連 - タヌキモ属 - ドクダミ - 雄蕊 - 葉身 - ルバーブ - ロシアンセージ
動物学
480 動物学 (62)：
480 動物学 (9)：オオカミの再導入 - 京子 - 市立名古屋動物園 - スージー (チンパンジー) - タチアナ (虎) - ツァボの人食いライオン - ハチ (ヒョウ) - ぶん公 - ラッコの保護活動
481 一般動物学 (4)：バブルネット・フィーディング - ベイツ型擬態 - ペッカム型擬態 - ミューラー型擬態
482 動物地理、動物誌 (4)：オーストラリアの動物相 - 狛江淡水クラゲ発生地 - コロンビアにおけるカバ - 十六島ホタルエビ発生地
483 無脊椎動物 (4)：二胚動物 - 星口動物 - 星の砂 - 腕足動物
484 軟体動物、棘皮動物 (2)：コウイカ - ヒトデ
485 節足動物 (3)：アマミサソリモドキ - シオダマリミジンコ属 - シャコ目
486 昆虫類 (8)：鼓膜器官 - シジミタテハ科 - シジミチョウ科 - シャープゲンゴロウモドキ - トコジラミ - ノコギリクワガタ - 蜂群崩壊症候群 - ミヤマクワガタ
487 脊椎動物 (17)：アンコウ目 - イタセンパラ - ウナギ科 - カジキ - カリフォルニアネコザメ - クロアジモドキ - 掃除魚 - トゲウオ科 - トラフザメ - ナマズ目 - ニシクロカジキ - 日本の両生類一覧 - ヘビの鱗 - ムカシトカゲ - ヨロイザメ - ラブカ - 両生類の減少
488 鳥類 (6)：インドハッカ - オウム - オウム目 - トキ - フクロウ - ヨコフリオウギビタキ
489 哺乳類 (5)：イヌの起源 - イリオモテヤマネコ - ウエスト・ハイランド・ホワイト・テリア - 喉鳴らし - ハリモグラ
医学、薬学
490 医学、薬学 (35)：
490 医学 (2)：根拠に基づく医療 - ユナニ医学
491 基礎医学 (1)：血小板
492 臨床医学、診断・治療 (6)：臍帯血 - 静脈注射 - 心停止 - 補助人工心臓 - 輸血 - 綿ふき病
493 内科学 (11)：インフルエンザワクチン - ギャンブル依存症 - 境界性パーソナリティ障害 - 堺市学童集団下痢症 - ジカ熱 - 自己愛性パーソナリティ障害 - 重症急性呼吸器症候群 - デング熱 - 土佐のほっぱん - ニーマン・ピック病 - 八重山諸島のマラリア
494 外科学 (9)：気管切開 - 気管挿管 - 高度な気道確保 - 術中覚醒 - 神経ブロック - 脊髄くも膜下麻酔 - 全身麻酔 - 全身麻酔の歴史 - 乳房再建 - 麻酔
495 婦人科・産科学 (1)：無痛分娩
498 衛生学・公衆衛生・予防医学 (1)：患者安全
499 薬学 (3)：ゲフィチニブ - ヒトに由来する生薬 - フェンタニル
技術
（計300本）

500 技術、工学 (2)：中国の科学技術史 - モールの定理
510 建設工学、土木工学 (43)：
514 道路工学 (19)：愛岐トンネル群 - 赤羽台トンネル - アスファルト混合物 - 伊勢湾岸自動車道 - 北九州トンネル - 頸城トンネル - 笹子トンネル (中央本線) - 塩沢トンネル - 新東名高速道路 - 水底トンネル - 第1上野トンネル - 第2上野トンネル - 名古屋環状2号線 - 名古屋第二環状自動車道 - 鍋立山トンネル - 日本の道路標識 - 日本の路面標示 - 深坂トンネル - 六甲トンネル
515 橋梁工学 (11)：荒川橋梁 (東北本線) - 荒川橋 - 石狩川橋梁 - 上淀川橋梁 - 下淀川橋梁 - 新名神武庫川橋 - 第一白川橋梁 - 富士川橋梁 (東海道本線) - 別府明礬橋 - 名港トリトン - 澱川橋梁
516 鉄道工学 (2)：軌間 - 粘着式鉄道
517 河海工学、河川工学 (9)：石淵ダム - 国土交通省直轄ダム - 笹生川ダム - 新丸山ダム - スエズ運河 - 津軽ダム - 日本のダムの歴史 - 飛騨川流域一貫開発計画 - 丸山ダム
518 衛生工学、都市工学 (1)：タイ王国の便所
519 公害、環境工学 (1)：日立鉱山の大煙突
520 建築学 (21)：
521 日本の建築 (13)：くど造 - グリーンハウス (藤沢市) - 五稜郭 - 佐原の町並み - 佐原三菱館 - 市営基町高層アパート - 足袋蔵 - 中銀カプセルタワービル - 広島県産業奨励館 - 福山藩の辻堂 - 法隆寺再建非再建論争 - 町屋 (商家) - 我国将来の建築様式を如何にすべきや
522 東洋の建築、アジアの建築 (2)：アレッポ城 - イスラーム建築
523 西洋の建築、その他の様式の建築 (5)：オレゴン州会議事堂 - ギザの大ピラミッド - ティンツフィールド - ドゥーン城 - ローマ建築
526 各種の建築 (1)：トレイン・シェッド
530 機械工学、原子力工学 (85)：
531 機械力学・材料・設計 (2)：重ね板ばね - ねじ締結体
535 精密機器、光学機器 (1)：時計の歴史
536 運輸工学、車両、運搬機械 (55)：
536 運輸工学、車両、運搬機械：多摩湖鉄道の鉄道車両 - 鉄道車両 - 乗り心地
536.1 機関車工学、蒸気機関車：金沢電気軌道ED1形電気機関車 - 西武E851形電気機関車 - 福武電気鉄道デキ1形電気機関車
536.2 内燃機関車、気動車：ディーゼルカー、ガソリンカー：南満洲鉄道ケハ7型気動車 - 南満洲鉄道ジテ1型気動車
536.4 客貨車、車両付属装置、艤装：ボルスタアンカー
536.5 電車：
536.5021 日本：
536.50213 関東地方：小田急2600形電車 - 小田急3100形電車 - 小田急4000形電車 (初代) - 小田急5000形電車 (初代) - 小田急9000形電車 - 小田急10000形電車 - 小田急20000形電車 - 小田急50000形電車 - 小田原電気鉄道チキ1形電車 - 小田原電気鉄道チキ2形電車 - 京王7000系電車 - 京王8000系電車 - 京王9000系電車 - 京急700形電車 (2代) - 国鉄203系電車 - 西武3000系電車 - 西武30000系電車 - 東急7000系電車 (初代) - 東武200系電車
536.50214 北陸地方：福井鉄道F1000形電車
536.50215 中部地方：東山・東海地方：愛知電気鉄道デハ3300形電車 - 愛知電気鉄道電7形電車 - 伊勢電気鉄道ハ451形電車 - 知多鉄道デハ910形電車 - 東美鉄道デボ100形電車 - 名古屋鉄道デセホ700形電車 - 名古屋鉄道トク3号電車 - 名岐鉄道デボ800形電車 - 名鉄850系電車 - 名鉄3500系電車 (初代) - 名鉄3780系電車 - 名鉄3800系電車 - 名鉄5000系電車 (初代) - 名鉄6000系電車 - 名鉄6600系電車 - 名鉄7000系電車 - 名鉄7500系電車 - 名鉄モ600形電車 (2代) - 名鉄モ770形電車 (初代) - 名鉄モ3350形電車 (初代)
536.50216 近畿地方：叡山電鉄700系電車 - 近江鉄道モハ131形電車
536.50217 中国地方：広島瓦斯電軌1040形電車 - 広島電鉄2500形電車
536.50219 九州地方：熊本市交通局0800形電車 - JR九州883系電車
538 航空工学、宇宙工学 (26)：
538.5 飛行船：ZMC-2
538.6 飛行機：エアバスA300-600 - エアバスA310 - エアバスA318 - エアバスA319 - エアバスA320 - エアバスA321 - エアバスA330 - エアバス ベルーガ - ボーイング717 - ボーイング757 - ボンバルディア CRJ - マクドネル・ダグラス MD-90
538.7 軍用機：五式戦闘機 - フォッケウルフ Fw190
538.8 航空術、運航技術：アメリカン航空191便墜落事故 - アメリカン航空587便墜落事故 - イースタン航空401便墜落事故 - ガボン航空惨事 - 2020年カラバサスヘリコプター墜落事故 - ニュージーランド航空901便エレバス山墜落事故
538.9 宇宙飛行、宇宙開発、人工衛星：アポロ17号 - アポロ計画 - 宇宙ステーション補給機 - HTV技術実証機 - ミネルバ (ローバー)
539 原子力工学 (1)：ジルコニウム火災
540 電気工学 (54)：
540 電気工学 (46)：
540 電気工学：電気
540.9 電気事業、電力事業：
540.92 電気事業史・事情：
540.921 日本：猪苗代水力電気 - 合同電気 - 昭和電力 - 大同電力 - 中央電気 - 東邦電力 - 新潟電気 - 新潟電力 - 日本水力 - 配電統制令
540.9213 関東地方：茨城電気 (1931-1942) - 笠間電気 - 京浜電力 - 多賀電気 - 東京電力 (1925-1928)
540.9214 北陸地方：神岡水電 - 佐渡電灯 - 日本海電気
540.9215 中部地方：東山・東海地方：梓川電力 - 稲沢電灯 - 木曽川電力 - 木曽電気製鉄 - 信濃電気 - 信越電力 - 中央電力 (1938-1942) - 中部電力 (1930-1937) - 津電灯 - 東信電気 - 長野電灯 - 名古屋電力 - 飛騨電灯 - 北越水力電気 - 松阪電気 - 松本電灯 - 宮川電気 - 矢作水力
540.9216 近畿地方：大阪電灯 - 関西私鉄の電力供給事業
540.9219 九州地方：九州水力電気 - 九州送電 - 九州電灯鉄道 - 熊本電気 - 長崎電気瓦斯 - 広滝水力電気
543 発電 (4)：石岡第一発電所 - 石岡第二発電所 - イビデンの水力発電所 - 八百津発電所
544 送電・変電・配電 (1)：変電所
545 電灯・照明・電熱 (1)：二股ソケット
547 通信工学・電気通信 (2)：大西洋横断電信ケーブル - 補聴器の歴史
548 情報工学 (3)：配膳ロボット - 物体検出 - Robot Operating System
550 海洋工学、船舶工学、兵器、軍事工学 (17)：壱岐丸 - 神威 (水上機母艦) - 君沢形 - 翔鳳丸 - 石油タンカー - 第五海洋丸の遭難 - 第五青函丸 - 竹 (松型駆逐艦) - 津軽丸 (2代) - 天洋丸級貨客船 - 洞爺丸 - 長波 (駆逐艦) - ばら積み貨物船 - 檜山丸 (初代) - 比羅夫丸 - ポジャールスキー公 (装甲巡洋艦) - 夕凪 (2代神風型駆逐艦)
560 金属工学、鉱山工学 (21)：
560.9 鉱業経済 (1)：朝鮮民主主義人民共和国の鉱業
561 採鉱、選鉱 (2)：鉱床学 - 日立鉱山の鉱害問題
562 各種の金属鉱床・採掘 (4)：水銀の遺産アルマデンとイドリヤ - 中小坂鉄山 - 長登銅山 - 日立鉱山
563 冶金、合金 (3)：異種金属接触腐食 - 水素吸蔵合金 - 全面腐食
564 鉄鋼 (5)：オーステナイト系ステンレス鋼 - オーステナイト・フェライト系ステンレス鋼 - 析出硬化系ステンレス鋼 - フェライト系ステンレス鋼 - マルテンサイト系ステンレス鋼
566 金属加工、製造冶金 (3)：押出成形 - 焼入れ - 焼戻し
567 石炭 (1)：大嶺炭田
569 非金属鉱物、土石採取業 (2)：伊豆珪石鉱山 - 北大東島のリン鉱山
570 化学工業 (3)：合成ダイヤモンド - DNAナノテクノロジー - 発泡プラスチック
580 製造工業 (36)：
585 パルプ・製紙工業 (3)：因州和紙 - 黒谷和紙 - 杉原紙
586 繊維工学 (2)：丹後ちりめん - 藤織り
587 染色加工、染色業 (4)：葵梶葉文染分辻が花染小袖 - 有松・鳴海絞り - 白綾地秋草模様小袖 - 白練緯地松皮菱竹模様小袖
588 食品工業 (26)：
588.3 パン、菓子類：ういろう (企業) - ウチキパン - 川端道喜 - プッチンプリン - ヨーグル
588.4 清涼飲料：炭酸飲料、サイダー、ラムネ、果汁、酸性飲料：ウィルキンソンタンサン鉱泉宝塚工場
588.5 醗酵工業、酒類：アードベッグ蒸留所 - アルゼンチンワイン - 芋焼酎 - オーストラリアワイン - オレゴン・ワイン - カリフォルニアワイン - 西条酒 - ジン (蒸留酒) - スプリングバンク蒸溜所 - スペインワイン - 丹後杜氏 - 朝鮮の日本酒 - 長濱蒸溜所 - 白州蒸溜所 - ボルドーワイン - 山崎蒸溜所 - ラガヴーリン蒸留所
588.9 食品保存：保存食品：すきやき (ふりかけ) - のりたま - 防衛食容器
589 その他の雑工業 (2)：行田足袋 - ナカプリバイン
590 家政学、生活科学 (15)：アイヌ料理 - アジフライ - 小樽あんかけ焼そば - カレーうどん - カレーパン - 玩具 - スペイン料理 - 電気パン - 名張牛汁 - ナポリタン - ばらずし (丹後地方) - ハンガリー料理 - 日の丸弁当 - フィリピン料理 - フルーツサンド
産業
（計106本）

600 産業 (3)：亜細亜大博覧会 - つねよし百貨店 - 日本大博覧会
610 農業 (9)：遺伝子組み換え作物 - ゴールデンライス - サフランの取引と利用 - 下肥 - 下山千歳白菜 - 白小豆 - 滝野川ゴボウ - 東京うど - 緑の革命
620 園芸、造園 (4)：水琴窟 - セントラル・パーク - ペラム・ベイ・パーク - マッキントッシュ (リンゴ)
630 蚕糸業 (2)：富岡製糸場 - 富岡製糸場と絹産業遺産群
640 畜産業 (2)：カエルツボカビ症 - ピンクスライム
650 林業、狩猟 (1)：福山藩の砂留
660 水産業 (7)：イルカ追い込み漁 - 宇川のアユ - キャベツウニ - 袖志の海女 - 間人ガニ - 鳥羽磯部漁業協同組合 - バーレーンの真珠採取業
670 商業 (18)：大人買い - カードの切り方が人生だ - カレーショップ志み津 - ケンタッキーフライドチキンの歴史 - 氷貿易 - 食品サンプル - 先収会社 - 中国料理ピカイチ - どん底 (飲食店) - 日本の貿易史 - ヒトカラ - 福山そごう - 貿易史 - 蓬萊社 - 三越日本橋本店 - ミラノ風ドリア - ヤマザキ春のパンまつり - 私作る人、僕食べる人
680 運輸、交通、観光事業 (57)：
682 交通史・事情 (2)：730 (交通) - 箱根山戦争
683 海運 (2)：富山県営渡船 - 日華連絡船
685 陸運、道路運輸 (6)：神奈川中央交通 - 東京乗合自動車 - 日本の深夜バス - 箱根登山バス - 北海道中央バス - 山梨交通
686 鉄道運輸 (40)：
686.2 鉄道史・事情：
686.21 日本：
686.21 日本：オリエント・エクスプレス '88
686.211 北海道地方：深名線
686.212 東北地方：岩泉線
686.213 関東地方：五日市鉄道 - 小田急電鉄のダイヤ改正 - 小田急箱根 - 小田急ロマンスカー - 西武球場前駅 - 東京駅の歴史 - 東京都港湾局専用線 - 根府川駅列車転落事故 - はるひ野駅 - 箒川鉄橋列車転落事故
686.214 北陸地方：金沢電気軌道 - 蒲原鉄道線 - 北陸線列車雪崩直撃事故 - 北陸鉄道金沢市内線
686.215 中部地方：東山・東海地方：愛知電気鉄道 - 知多鉄道 - 名古屋急行電鉄 - 名古屋市電笹島線 - 南方貨物線 - 碧海電気鉄道
686.216 近畿地方：近江鉄道本線 - 南草津駅 - 吉野鉄道
686.217 中国地方：一畑電車 - 広島電鉄
686.218 四国地方：阿南鉄道 - 阿波電気軌道
686.219 九州地方：博多電気軌道 - 福博電気軌道
686.23 ヨーロッパ、西洋：インターシティ (ドイツ) - グレート・ノーザン・ピカデリー・アンド・ブロンプトン鉄道 - チャリングクロス・ユーストン・アンド・ハムステッド鉄道 - TEE - ベーカーストリート・アンド・ウォータールー鉄道 - ロンドン地下電気鉄道
686.25 北アメリカ：アメリカ合衆国の鉄道史
686.7 運行、操車、配車、列車運転、鉄道事故：列車
687 航空運輸 (3)：サウスウエスト航空 - D.B.クーパー事件 - 富山飛行場
689 観光事業 (4)：富士山縦覧場 - 船原ホテル - まぼろし博覧会 - 楽々園遊園地
690 通信事業 (3)：浮世絵切手 - コーヒー切手 - スタッフが美味しくいただきました
芸術
（計333本）

700 芸術、美術 (23)：
700 芸術、美術 (1)：民藝運動
702 美術史、芸術史 (9)：イスラム美術 - インドの美術 - 紙本墨書南番文字 - 中央アジアの美術 - 東大寺献物帳 - 日本のアウトサイダー・アート - 長谷寺銅板法華説相図 - 仏教美術 - 六角堂 (北茨城市)
706 団体：学会、協会、会議 (2)：かんなみ仏の里美術館 - ルーヴル美術館
709 芸術政策、文化財 (11)：白川郷・五箇山の合掌造り集落 - シルクロード (世界遺産) - チャンアンの景観関連遺産 - 登録無形民俗文化財 - 平泉 - ブダペストのドナウ河岸とブダ城地区およびアンドラーシ通り - ブルゴーニュのブドウ畑のクリマ - 文化遺産保護制度 - ポーランドの世界遺産 - ボルガル遺跡 - ル・コルビュジエの建築作品-近代建築運動への顕著な貢献-
710 彫刻、オブジェ (5)：清凉寺木造釈迦如来立像 - 東大寺の仏像 - ネフェルティティの胸像 - 広島大仏 - 法量
720 絵画、書、書道 (68)：
720 絵画 (2)：第1回印象派展 - 日本パノラマ館
721 日本画 (10)：葛飾北斎 - 狩野派 - 絹本著色後醍醐天皇御像 - 駒競行幸絵巻 - 東雲篩雪図 - 徳川家康三方ヶ原戦役画像 - 鯰絵 - 南画 - 普賢菩薩像 (東京国立博物館本) - ○△□ (絵画)
722 東洋画 (1)：中国の絵画
723 洋画 (28)：
723.1 日本：アッツ島玉砕 - 北川民次 - 湖畔 (絵画) - 鮭 (高橋由一) - 読書 (黒田清輝)
723.3 ヨーロッパ、西洋：ヴァージナルの前に座る若い女 - エドヴァルド・ムンク - オランダ黄金時代の絵画 - 快楽の園 - 鏡のヴィーナス - カミーユ・ピサロ - 岩窟の聖母 - 牛乳を注ぐ女 - キリスト磔刑と最後の審判 - クロード・モネ - ゲルニカ (絵画) - システィーナの聖母 - 死の勝利 (ブリューゲル) - ジャン＝フランソワ・ミレー - 聖家族 (ミケランジェロ) - デルフト眺望 - ピエール＝オーギュスト・ルノワール - 兵士と笑う女 - ヘントの祭壇画 - ポール・セザンヌ - ミケランジェロ・メリージ・ダ・カラヴァッジオ - ラス・メニーナス - レンブラント・ファン・レイン
726 漫画、挿絵、児童画 (23)：
726 漫画、挿絵、児童画：シグネ・ハンマシュティエン＝ヤンソン
726.1 漫画、劇画、諷刺画：荒木飛呂彦 - アラン・ムーア - 海が走るエンドロール - カンポンボーイ - キャプテン翼 - 金のはさみのカニ - 久世岳 - 黒い島のひみつ - これ描いて死ね - サトコとナダ - サンルームにて - ジョルジュ・ビゴー - 空がすき! - 龍幸伸 - 地球の秘密 - 動物漫画 - ぱいどん - フィリピンの漫画 - プロビデンス (コミック) - よしづきくみち - ラット (漫画家)
726.5 挿絵、イラストレーション：不思議の国のアリスの挿絵
728 書、書道 (4)：後醍醐天皇宸翰天長印信（蠟牋） - 禅林墨跡 - 中国の書道史 - 風信帖
730 版画、印章、篆刻、印譜 (4)：犀 (木版画) - 東海道五十三次 (浮世絵) - 富嶽百景 (北斎) - 北斎漫画
740 写真、印刷 (1)：鹿島清兵衛
750 工芸 (13)：イスラームの陶芸 - 家屋文鏡 - 木内綾 - 鵲尾形柄香炉 (国宝) - 中国の青銅器 - 中国の陶磁器 - 土器 - 日本の古瓦 - 日本の染織工芸 - 埴輪 踊る人々 - 埴輪 挂甲武人 - 舟橋蒔絵硯箱 - 竜首水瓶
760 音楽、舞踊、バレエ (72)：
762 音楽史、各国の音楽 (21)：
762.1 日本：小林ハル
762.3 ヨーロッパ・西洋：アーノルド・バックス - アルトゥール・ニキシュ - エドワード・エルガー - エンリケ・ホルダ - オトマール・スウィトナー - カール・ニールセン - カール・ミュンヒンガー - カミーユ・サン＝サーンス - ゲオルク・フリードリヒ・ヘンデル - ジュゼッペ・ヴェルディ - ジョルジュ・ビゼー - スコモローフ - チャイコフスキーとベリャーエフ・サークル - チャイコフスキーとロシア5人組 - チャールズ・ヴィリアーズ・スタンフォード - フェルディナント・ライトナー - フレデリック・ディーリアス - モーツァルト家の大旅行 - ロシアのクラシック音楽史
762.5 北アメリカ：エリザベス・スプレーグ・クーリッジ
763 楽器・器楽 (2)：アルプ・シュニットガー - 子供のために
764 器楽合奏 (9)：ヴァイオリンソナタ (ラヴェル) - 美しく青きドナウ - 海 (ドビュッシー) - 海へ (武満徹) - 弦楽のためのレクイエム - 交響曲第5番 (チャイコフスキー) - 吹奏楽の歴史 - ピアノ五重奏曲第2番 (フォーレ) - 4分33秒
766 劇音楽 (2)：松竹歌劇団 - ニュルンベルクのマイスタージンガー
767 声楽 (32)：
767.3 独唱：マダガスカル島民の歌
767.4 合唱［コーラス］、重唱：5つのルシャン - 戦争レクイエム
767.7 学校唱歌、童謡：お猿のかごや - チューリップ (唱歌) - どんぐりころころ
767.8 歌謡曲、流行歌、シャンソン、ジャズソング：アルトン・エリス - Umbrella (清水翔太のアルバム) - INSTANT LOVE - 回帰線 (尾崎豊のアルバム) - 街路樹 (尾崎豊のアルバム) - 笠置シヅ子 - 恋人たちのクリスマス - 壊れた扉から - PSYCHOPATH - THE DREAM CHAPTER: ETERNITY - Summer Madness (三代目J Soul Brothers from EXILE TRIBEの曲) - Signalize!/カレンダーガール - JUST A HERO (BOØWYのアルバム) - 十七歳の地図 (アルバム) - 新宝島 (曲) - ソリクン - 高輪芳子 - 誕生 (尾崎豊のアルバム) - 罪と罰 (椎名林檎の曲) - 能動的三分間 - 『バッハの旋律を夜に聴いたせいです。』 - BEAT EMOTION - BOØWY (アルバム) - 放熱への証 - MONSTER GENERATiON - ユーロビジョン・ソング・コンテスト2009
768 邦楽 (1)：秋庭歌
769 舞踊、バレエ (5)：タマーラ・カルサヴィナ - トウシューズ - ナデジダ・パヴロワ (1905年生のバレエダンサー) - 白鳥の湖 - プリエ
770 演劇、映画、大衆芸能 (56)：
772 演劇史、各国の演劇 (1)：園井恵子
773 能楽、狂言 (2)：観世元滋 - 櫻間伴馬
774 歌舞伎 (1)：外郎売
775 各種の演劇 (2)：小百合葉子 - 山本安英
778 映画 (49)：
778.09 映画産業：映画配給、映画館、映画政策、映画検閲、映画の輸出入、入場料：豊橋市の映画館
778.2 映画史、各国の映画：スウィーニー・トッド フリート街の悪魔の理髪師
778.21 日本：海辺のエトランゼ (映画) - 海辺の生と死 (映画) - 映画 聲の形 - 炎上 (映画) - かぐや姫の物語 - からっ風野郎 - 岸辺露伴 ルーヴルへ行く (映画) - きらめき☆プロジェクト - 狂つた一頁 - Charlotte (アニメ) - 少女☆歌劇 レヴュースタァライト (アニメ) - 涼宮ハルヒの消失 (映画) - 涼宮ハルヒの憂鬱 (アニメ) - 千と千尋の神隠し - 人斬り (映画) - 魔女見習いをさがして - MIU404 - やがて君になる (アニメ) - ようこそ実力至上主義の教室へ (テレビアニメ) - リズと青い鳥 - リッチマン、プアウーマン
778.23 ヨーロッパ・西洋：アンドレイ・ルブリョフ (映画) - エドワード七世の戴冠式 - 月世界旅行 (映画)
778.25 北アメリカ：イングロリアス・バスターズ - トロールズ ミュージック★パワー - 火の海 - 我等の生涯の最良の年
778.3 映画監督・俳優、演技、配役：青木鶴子 - アリス・ギイ - アルフレッド・ヒッチコック - オードリー・ヘプバーン - 小津安二郎 - 黒澤明 - サタジット・レイ - チャールズ・チャップリン - 早川雪洲 - 水の江瀧子 - 溝口健二 - 山中貞雄 - ラージクマール・ラーオ - ライアン・ゴズリング - ラジニカーント - ローレン・バコール
778.4 映画制作および演出、撮影技術：キネトスコープ - シネマトグラフ - トーキー
779 大衆演芸 (1)：ラーメンズ
780 スポーツ、体育 (58)：
780 スポーツ、体育 (1)：中華人民共和国のスポーツ
781 体操、遊戯 (2)：ケイドロ - ナディア・コマネチ
782 陸上競技 (3)：野口源三郎 - パーヴォ・ヌルミ - 渡辺康幸
783 球技 (21)：
783.2 バレーボール：呉工廠排球チーム
783.4 フットボール：ゴールパフォーマンス - 全日空横浜サッカークラブ・ボイコット事件 - ハインズ・ウォード - ヒルズボロの悲劇 - フランク・ライカールト - ヘイゼルの悲劇 - ペレ - ボビー・ロブソン - ミシェル・プラティニ - ユヴェントスFC - ヨハン・クライフ
783.7 野球：今中慎二 - 郭源治 - 郭泰源 - CC・サバシア - 2011年のワールドシリーズ - 2013年の東北楽天ゴールデンイーグルス - フェイ・ヴィンセント - ヨハン・サンタナ - レイ・チャップマン
784 冬季競技 (1)：猪谷千春
786 戸外レクリエーション (1)：2008年北京オリンピックの自転車競技・男子個人ロードレース
788 相撲、拳闘、競馬 (28)：
788.2 レスリング：三沢光晴
788.5 競馬：アグネスフライト - 板橋競馬場 - 上野不忍池競馬 - エルコンドルパサー - 尾形藤吉 - 関東州の競馬 - 神戸居留地競馬 - シーキングザパール - 地方競馬 - ジョージ4世と競馬 - トウカイテイオー - トウショウボーイ - トキノミノル - ハイセイコー - ヒサトモ - ビワハヤヒデ - フューチュリティステークス (アメリカ合衆国) - 松戸競馬場 - マツリダゴッホ - ミスターシービー - ミホシンザン - メジロブライト - メジロマックイーン - メジロライアン - 横浜新田競馬場 - ライスシャワー - ラムタラ
789 武術 (1)：エメリヤーエンコ・ヒョードル
790 諸芸、娯楽 (33)：
795 囲碁 (1)：オセロ (ボードゲーム)
797 射倖ゲーム (1)：ウル王朝のゲーム
798 室内娯楽 (30)：
798 室内娯楽：競技クイズ
798.5 テレビゲーム：天色＊アイルノーツ - UNDERTALE - OMORI - カルマルカ*サークル - Justy×Nasty 〜魔王はじめました〜 - 創作彼女の恋愛公式 - たぬきち - ダブルキャスト (ゲーム) - テイルズ オブ ザ テンペスト - Déraciné (ゲーム) - 刀剣乱舞無双 - ナムコ - Nintendo Switchのゲームタイトル一覧 (2017年) - Nintendo Switchのゲームタイトル一覧 (2018年) - Nintendo Switchのゲームタイトル一覧 (2019年) - Nintendo Switchのゲームタイトル一覧 (2020年) - Nintendo Switchのゲームタイトル一覧 (2021年) - はつゆきさくら - 花と乙女に祝福を - PlayStation 2のゲームタイトル一覧 (2006年) - PlayStation 4のゲームタイトル一覧 (2014年-2015年) - PlayStation 4のゲームタイトル一覧 (2016年) - PlayStation 4のゲームタイトル一覧 (2017年) - PlayStation 5のゲームタイトル一覧 (2020年-2021年) - PlayStation 5のゲームタイトル一覧 (2022年) - 星織ユメミライ - メガCDのゲームタイトル一覧 - メガドライブのゲームタイトル一覧 - Monkeys!¡ - Last Labyrinth (ゲーム)
言語
（計17本）

800 言語 (2)：エストニアの言語 - 結縄
810 日本語 (11)：秋田弁 - 一姫二太郎 - エビフリャー - 激おこぷんぷん丸 - 神代文字 - ダ埼玉 - 童貞を殺す服 - 日本語の方言のアクセント - 判官贔屓 - ものわりのはしご - 四字熟語
830 英語 (1)：英語の冠詞
850 フランス語、プロバンス語 (1) ：ふらんす
890 その他の諸言語 (2)：シュスワプ語 - ロンゴロンゴ
文学
（計99本）

900 文学 (1)：詩
910 日本文学 (9)：青空 (雑誌) - カバヤ児童文庫 - JUNE (雑誌) - 「たけくらべ」論争 - ドナルド・キーン - 蓮田善明 - 文藝時代 - 八百屋お七 - 山川彌千枝
911 詩歌 (13)：池水は濁りににごり藤波の影もうつらず雨降りしきる - 大塚陽子 - 玉葉和歌集 - 去来抄 - 鶏頭の十四五本もありぬべし - この世をば 我が世とぞ思ふ 望月の 欠けたることも 無しと思へば - 小林一茶 - 税所敦子 - 正田篠枝 - 中城ふみ子 - 二条為子 - 古池や蛙飛びこむ水の音 - 宮沢賢治
912 戯曲 (4)：屋上の狂人 - 加藤道夫 - 毛皮のマリー - 出家とその弟子
913 小説、物語 (39)：
913.3 古代後期（中古）：平安時代：源氏物語大成 - 巣守
913.6 近代：明治以後：安土往還記 - ある心の風景 - 井亀あおい - 女方 (小説) - 海市 - 廻廊にて - 薤露行 - 岳物語 - 梶井基次郎 - 川端康成 - 川端康成第四短篇集「心中」を主題とせるヴアリエイシヨン - 器楽的幻覚 - 草の花 - 山椒魚 (小説) - 志賀寺上人の恋 - 清水澄子 (さゝやき) - 邪宗門 (高橋和巳) - 少年 (川端康成) - 心中 (川端康成) - 水晶幻想 - スタア - 宣告 - 太宰治と自殺 - 掌の小説 - たんぽぽ (小説) - 散りぬるを (小説) - 中島敦 - ふたりのイーダ - 船山春子 - 冬の蠅 - 冬の日 (小説) - ベルカ、吠えないのか? - 忘却の河 - 万葉翡翠 - 結城明日奈 - ようこそ実力至上主義の教室へ - 夜長姫と耳男
914 評論、エッセイ、随筆 (1)：末期の眼
915 日記、書簡、紀行 (1)：曾良旅日記
920 中国文学、その他の東洋文学 (5)：ウルドゥー語文学 - 西遊記の成立史 - 三国志演義の成立史 - 水滸伝の成立史 - 賦
930 英米文学 (15)：アーサー・コナン・ドイル - エドガー・アラン・ポー - 黄金虫 (小説) - 影との戦い - キャッチ=22 - クマのプーさん - シェイクスピア別人説 - ジャバウォック - ハンバーガー殺人事件 - ビアトリクス・ポター - ファンタスティック・アドベンチャーズ - マックス・パーキンズ - マルタの鷹 - ルイーザ・メイ・オルコット - 老人と海
940 ドイツ文学、その他のゲルマン文学 (5)：ガルム (雑誌) - グリム童話 - ゲオルク・ビューヒナー - トーベ・ヤンソン - フランツ・カフカ
950 フランス文学、プロバンス文学 (2)：ゴリオ爺さん - マルセル・プルースト
980 ロシア・ソビエト文学、その他のスラブ文学 (3)：ウクライナ文学 - デルスウ・ウザーラ (書籍) - ブィリーナ
990 その他の諸言語文学 (1)：アフリカ文学'''
# copy right before the paper's date (which contains fewer terms!!!).

def read_cat(text):
    cat_t = []
    cache = None
    def confirm():
        if confirm_cnt != len(cache):
            print('INFO:', cat_t[0], f'actually contains {len(cache)} instead of {confirm_cnt}.')
        for term in cache:
            yield term, cat_t[0]

    for line in text.split('\n'):
        if not line:
            continue
        if line.startswith('（計') and line.endswith('本）'):
            if cat_t and cache:
                yield from confirm()
                cache = set()
            if cat_t:
                cat_t = cat_t[-1:]

            confirm_cnt = int(line[2:-2])
            continue
        if line[0].isdigit():
            if '：' not in line:
                continue
            # cumulate old
            if line := line[line.rindex('：') + 1:].strip():
                cache.update(line.split(' - '))
        else:
            cat_t.append(line)
            if len(cat_t) == 1:
                cache = set()
    yield from confirm()

feat_cat = dict(read_cat(feat_text))
good_cat = dict(read_cat(good_text))

assert not (feat_cat.keys() & good_cat.keys())
chen_cat_t = {**feat_cat, **good_cat}

i2t = {}

def load(s):
    not_in_text = []
    with open(f'wikipedia_{s}_key.csv') as fr:
        assert next(fr) == 'wiki_header,class,key_1,key_2\n'
        for line in fr:
            term, cat_i, _ = line.rstrip().split(',', 2)
            term = term.strip()
            if cat_t := chen_cat_t.get(term):
                if cat_i in i2t:
                    assert cat_t == i2t[cat_i], f'Debug only - {term} - C:{cat_t}; N:{cat_i} {i2t[cat_i]}'
                else:
                    i2t[cat_i] = cat_t
            else:
                not_in_text.append(term)
            yield term, (cat_i, s)
    if not_in_text:
        print('INFO:', f'{len(not_in_text):2d} terms from Nagai {s:<5} split are not found in the above text (but their category are casted with the help of other samples).')
        print('\t'.join(not_in_text))

nagai_split = {}
nagai_split.update(load('train'))
nagai_split.update(load('valid'))
nagai_split.update(load('test'))

wiki_cat = {}
not_found = []
for term, (cat_i, split) in nagai_split.items():
    if cat_t := chen_cat_t.get(term):
        assert i2t[cat_i] == cat_t
    else:
        cat_t = i2t[cat_i]
    wiki_cat[term] = cat_t, split


if not_found:
    not_found.sort()
    print(f'INFO: {len(not_found)} are not in Nagai splits.')
    print('\t'.join(not_found))

import json
from difflib import SequenceMatcher
with open('../JADOS-Wiki/data/wikipedia_corpus/wikipedia_v0.1.2.json') as fr:
    titles = {w['title'] for w in json.load(fr)}

remaining = {}
with open('stratified_split.csv', 'w') as fw:
    fw.write('key,class,split\n')
    for term, (cat_t, split) in wiki_cat.items():
        assert ',' not in term
        if term in titles:
            titles.remove(term)
            fw.write(f'{term},{cat_t},{split}\n')
        else:
            remaining[term] = None

    print('INFO:', f'resolute for {len(remaining)} titles with ambuguious string.')
    for src in remaining:
        dst = max(titles, key = lambda dst: SequenceMatcher(None, src, dst).ratio())
        cat_t, split = wiki_cat[src]
        fw.write(f'{dst},{cat_t},{split}\n')
        print(f'    {src}')
        print(f' -> {dst}')

print('INFO:', f'{len(wiki_cat)} terms are in the Nagai splits.')
for s in ('train', 'valid', 'test'):
    print(f'{s:>7} {sum(1 for w in wiki_cat.items() if w[1][1] == s):5,d}')
print('INFO: cat code', i2t)